package oop05_polymorphism.trycatch;
/*
 * 프로그램 오류 발생 시점에 따라 컴파일 에러와 런타임 에러로 나뉨
 * 
 * 컴파일 에러
 * java에 대한 에러
 * 컴파일어가 소스코드에 대해 오타나 잘못된 구분, 자료형 등의 기본적인 검사를 수행하여 오류 여부를 알려줌
 * 
 * 런타임에러
 * 프로그램 실행 중 발생하는 에러
 * 런타임 에러는  에러와 예외(exception)로 나뉜다.
 * 
 * 에러는 메모리 부족이나 stackoverflow 같이 일단 발생하면 복구할 수 없는 심각한 오류
 * 프로그램에 의해 수습할 수 없는 심각한 오류
 * 예외는 발생하더라도 수습할 수 있는 비교적 덜 심각한 것
 * 
 * 예외처리 (exception handling)
 * 정의  :  프로그램 실행 시 발생할 수 있는 예외의 발생에 대비한 코드 작성
 * 목적  :  프로그램의 비정상 종료를 막고, 정상적인 실행상대를 유지하는 것.
 */

public class ExceptionHandling {
	

}
