package oop01_Syntex;

/*
 * Date : 2015.05.18
 * Author :  hanskim
 * Desc :  Method 문법
 * 
 * 
 * 메소드 개요
 * 
 * 함수 = method = function =procedure 
 * (cf. 엄밀히 말하면 함수와 메소드는 약간 다름) 
 * 1. 리턴값 있어야 함  , 없으면 void 
 * 2. 메소드는 함수 이름 다음에 괄호가 있어야 함
 * 3. 메소드가 필요한 경우 메소드이름(파라미터){} 형대
 * 3. 
 * 
 * 메소드 Syntax
 * c언어 함수와 동일( 엄밀히 동일하지 않다)
 * 데이터처리 기능 구현
 * 리턴값이 없는 메소드는  void
 * 메소드가 받는 파라미터와 데이터 타입은 메소드 호출하는 쪽과 동일해야함
 * 오버로딩 (중복사용) , 오버라이딩(재정의) 기술로 확장
 * 메소드 리턴값과 리턴값을 받는 데이터의 타입은 동일해야함
 * 
 * 메소드호출방법
 * 참조변수.메소드이름 (파라미터, 파라미터) ; 
 * 
 * 
 * 메소드의 종류
 * static 메소드  = (고)정적 메소드 ,클래스 메소드 ,  static이 붙은 메소드는 인스턴스 사용 불가
 *              = 오버라이딩, 오버로딩 안됨!!
 *              얘는 객체지향의 속성 4개 중 3개가 어긋남 (은닉화는 보류)
 *              이것때문데 자바가 객체언어가 아니라 !! 객체지향!! 언어다.!!
 * 
 * non -static 메소드 = 일반 메소드, 인스턴스 메소드,  static 없음
 * 멤변 중 모든 모든 인스턴스를 공동사용
 * 인스턴스 변수 사용해야함
 * 
 * 오버로딩
 * 메소드 중복, 파라미터 갯수나 타입만 다름
 * 메소드 이름은 동일
 * 
 * cf ) 선 언 vs 정 의
 * Declaration  : 공간을 맏들어 놓는 것  ,, 주소만 설정하는 거
 * Definition :  값을 할당     ,, 그 주소에서 어떤 행위를 하는 거.
 * 
 */

public class No04_MethodSyntax {

}
