package oop01_Syntex;


 /*
* Date : 2015.05.18
* Author :  hanskim
* Desc : 생성자 문법
* 
* 
* 초기화 
*  - 어떤 작업 (현실 : job , 프로그램 : process) 시작 전
*  준비  (: 현실 : standby , ready) 를 하게됨
*  ==> 프로그램에서 "초기화"라 함
*  
*  생성자
*  1. 값을 반환하지 않는다 , 리턴도 없고 void도 표시하지 않는다
*  2. 생성자의 이름은 클래스의 이름과 동일
*  3. 생성자를 명기하지 않는면 디폴트 생성자(파라미터 무)가 컴파일러에 의해 자동 생성됨
*  4. 생성자가 여러개일 때 다른 생성자를 호출 할 수 있다
*  5. 이때 this()를 통하여 클래스 내부에서 다른 생성자를 호출
*  6. 맨 첫줄에서 단 한번만 호출 가능
*  7. super() 는 부모의 생성자를 호출한다(상속 개념이 아니다) / 기본적으로 생성자는 상속되지 않음 
*/
public class No05_ConstructorSyntax {
	


}
